NextFOAM-2501/tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            nutUWallFunction;
        value           uniform 0;
    }

    topAndBottom
    {
        type            nutUWallFunction;
        value           uniform 0;
    }

    hot
    {
        type            nutUWallFunction;
        value           uniform 0;
    }

    cold
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
